In [1]:
import pandas as pd
import numpy as np
foods=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_foods.csv')
customer=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_customers.csv')
week1=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_week_1_sales.csv')
week2=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_week_2_sales.csv')

In [2]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [3]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [5]:
week1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [6]:
week2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [8]:
week1.merge(week2, how="outer", on="Customer ID")

     Customer ID  Food ID_x  Food ID_y
0              3        2.0        NaN
1              8        NaN        6.0
2             10        2.0        NaN
3             13        NaN        2.0
4             20        1.0        NaN
..           ...        ...        ...
449          985        5.0        NaN
450          991        2.0        NaN
451          994        NaN        2.0
452          996        NaN       10.0
453         1000        2.0        NaN

[454 rows x 3 columns]

In [9]:
week1.merge(week2, how="outer", on="Customer ID", suffixes=["- week1", "- week2"])

     Customer ID  Food ID- week1  Food ID- week2
0              3             2.0             NaN
1              8             NaN             6.0
2             10             2.0             NaN
3             13             NaN             2.0
4             20             1.0             NaN
..           ...             ...             ...
449          985             5.0             NaN
450          991             2.0             NaN
451          994             NaN             2.0
452          996             NaN            10.0
453         1000             2.0             NaN

[454 rows x 3 columns]

In [10]:
week1.merge(week2, how="outer", on="Customer ID", suffixes=["- week1", "- week2"], indicator=True)

     Customer ID  Food ID- week1  Food ID- week2      _merge
0              3             2.0             NaN   left_only
1              8             NaN             6.0  right_only
2             10             2.0             NaN   left_only
3             13             NaN             2.0  right_only
4             20             1.0             NaN   left_only
..           ...             ...             ...         ...
449          985             5.0             NaN   left_only
450          991             2.0             NaN   left_only
451          994             NaN             2.0  right_only
452          996             NaN            10.0  right_only
453         1000             2.0             NaN   left_only

[454 rows x 4 columns]

In [11]:
#indicator tells u if its left only merge or right only or both

In [13]:
merged = week1.merge(week2, how="outer", on="Customer ID", suffixes=["- week1", "- week2"], indicator=True) #put in variable

In [14]:
merged["_merge"].value_counts()

_merge
right_only    197
left_only     195
both           62
Name: count, dtype: int64

In [15]:
merged[merged["_merge"].isin(["left_only","right_only"])] #gives both left and right not both

     Customer ID  Food ID- week1  Food ID- week2      _merge
0              3             2.0             NaN   left_only
1              8             NaN             6.0  right_only
2             10             2.0             NaN   left_only
3             13             NaN             2.0  right_only
4             20             1.0             NaN   left_only
..           ...             ...             ...         ...
449          985             5.0             NaN   left_only
450          991             2.0             NaN   left_only
451          994             NaN             2.0  right_only
452          996             NaN            10.0  right_only
453         1000             2.0             NaN   left_only

[392 rows x 4 columns]

In [16]:
merged[merged["_merge"].isin(["left_only"])] #gives only left_only merge

     Customer ID  Food ID- week1  Food ID- week2     _merge
0              3             2.0             NaN  left_only
2             10             2.0             NaN  left_only
4             20             1.0             NaN  left_only
8             26             9.0             NaN  left_only
12            38             4.0             NaN  left_only
..           ...             ...             ...        ...
444          962             1.0             NaN  left_only
445          966             5.0             NaN  left_only
449          985             5.0             NaN  left_only
450          991             2.0             NaN  left_only
453         1000             2.0             NaN  left_only

[195 rows x 4 columns]

In [17]:
foods=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_foods.csv',index_col="Food ID")

In [18]:
foods

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49
6             Pasta  13.99
7             Steak  24.99
8             Salad  11.25
9             Donut   0.99
10            Drink   1.75

In [19]:
customer=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_customers.csv',index_col="ID")

In [20]:
customer

     First Name Last Name  Gender       Company                     Occupation
ID
1        Joseph   Perkins    Male       Dynazzy  Community Outreach Specialist
2      Jennifer   Alvarez  Female          DabZ        Senior Quality Engineer
3         Roger     Black    Male       Tagfeed              Account Executive
4        Steven     Evans    Male          Fatz               Registered Nurse
5          Judy  Morrison  Female       Demivee                Legal Assistant
...         ...       ...     ...           ...                            ...
996       Debra    Garcia  Female  Dazzlesphere            Structural Engineer
997     Douglas    Bishop    Male      Livepath                    Developer I
998       Frank  Franklin    Male    Brainverse             Nurse Practicioner
999     Jessica     Burns  Female    Babbleblab              Financial Advisor
1000      Brian   Daniels    Male         Tazzy     Physical Therapy Assistant

[1000 rows x 5 columns]

In [21]:
customer.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [22]:
foods.head()

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49

In [24]:
week1.merge(customer, how="left", left_on="Customer ID", right_index=True).merge(foods, how="left",left_on="Food ID", right_index=True)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99
...,...,...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer,Donut,0.99
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant,Pasta,13.99
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor,Taco,2.99
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer,Pasta,13.99
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate,Drink,1.75